# VARIABLE
'''
All text variables in the bot
'''

import random
start_text = 'به Outline VPN خوش آمدید.\n می توانید کلید دسترسی Outline VPN خود را از منوی Get Access Key ایجاد کرده و شروع به استفاده از آن کنید.'

get_menu_text = 'عملیاتی را که می خواهید انجام دهید انتخاب کنید:'

def contact_text():
    ticket_id = random.randint(10000, 99999)
    text = f'اگر به مشکلی برخوردید یا سؤال یا نگرانی دارید، ما همیشه خوشحالیم که به شما کمک کنیم.در هر زمان با ما تماس بگیرید.\n\n کد پشتیبانی شما: `{ticket_id}`'
    return text

referral_program_text = '❖ برنامه ارجاع\nکاربران را دعوت کنید و به دلار آمریکا پاداش بگیرید.\n\nبا دعوت از کاربران می توانید جوایز زیر را کسب کنید:\n• 10% کارمزد تمام سپرده های آنها.\n\nبرای دعوت از کاربران از لینک های زیر استفاده کنید\n`https://t.me/Outline_Man_Bot?start`'

choose_language_text = 'زبان خود را انتخاب کنید'

get_access_key_text = 'انتخاب کشور محل اقامت:'

other_operations_text = "عملیاتی را که می خواهید انجام دهید انتخاب کنید:"

what_outline_text = "❖ Outline VPN چیست؟ \nOutline به هر کسی امکان می‌دهد با اجرای VPN خود با خیال راحت‌تر به اینترنت رایگان و باز دسترسی داشته باشد. اجرای سرور VPN خود از طریق Outline دسترسی به اینترنت را ایمن تر می کند و اتصالی را ایجاد می کند که مسدود کردن آن سخت تر است."

why_outline_text = "❖ چرا Outline VPN؟ \nOutline زمانی کار می کند که سایر VPN ها مسدود شده باشند و در برابر اشکال پیچیده سانسور مانند مسدود کردن مبتنی بر شبکه یا مسدود کردن IP مقاوم باشد. \n Outline انعطاف پذیرتر است زیرا با استفاده از پروتکلی طراحی شده است که تشخیص آن دشوار است و بنابراین مسدود کردن آن سخت تر است. \n به طور خصوصی دسترسی به سرور خود را با گروهی از افراد قابل اعتماد به اشتراک بگذارید. افراد کمتری که به سرور شما متصل هستند به این معنی است که شناسایی آن سخت تر است و راحت تر می توانید خصوصی بمانید."

cancel_text = 'عملیات لغو شده است.'

outline_secure_text = "❖ آیا Outline امن است؟ \nOutline توسط دو شرکت امنیتی مستقل حسابرسی شده است.\n\nگزارش‌های آنها را اینجا بخوانید: Radically Open Security (مارس 2018، دسامبر 2022)، Cure53 (دسامبر 2018)."

why_use_text = "❖ چرا از VPN استفاده کنیم؟\nVPN ها برای خصوصی نگه داشتن ارتباطات شما مفید هستند و به شما امکان می دهند دسترسی به اینترنت باز را حفظ کنید. اما با اکثر ارائه دهندگان VPN، همیشه نمی دانید چه کسی VPN را کنترل می کند و چه کسی به داده های شما دسترسی دارد.\n\nایجاد سرور VPN خود تا کنون یک فرآیند پیچیده بود."

how_to_outline_text = "❖ چگونه از Outline VPN استفاده کنیم؟\n1) کلید دسترسی خود را از طریق ربات تلگرام Outline VPN (https://t.me/getoutlinevpn_bot) یا وب سایت (https://www.getoutlinevpn.com/) دریافت کنید.\n\n2) برنامه Outline VPN مناسب برای سیستم عامل خود را از منوی Application Center (https://www.getoutlinevpn.com/download) نصب کنید.\n\n3) برنامه Outline VPN را اجرا کنید.\n\n4) کلید دسترسی ایجاد شده را با کلیک بر روی علامت + در گوشه سمت راست بالا وارد کنید و روی دکمه «افزودن سرور» کلیک کنید.\n\n5) می توانید آن را با دکمه \"اتصال\" در کنار نام نمایه خود فعال کنید."

app_center_text = "پلتفرمی را که می خواهید Outline VPN را در آن راه اندازی کنید انتخاب کنید:"

price_list_text = "❖ لیست قیمت\nOutline به هر کسی امکان می‌دهد با اجرای VPN خود با خیال راحت‌تر به اینترنت رایگان و باز دسترسی داشته باشد. اجرای سرور VPN خود از طریق Outline دسترسی به اینترنت را ایمن تر می کند و اتصالی را ایجاد می کند که مسدود کردن آن سخت تر است. همین امروز کلید دسترسی Outline VPN خود را دریافت کنید.\n\nهزینه های VPN را به ازای هر ترافیک مشخص کنید. شما می توانید بسته ای را انتخاب کنید که متناسب با نیاز شما باشد. می توانید از منوی «دریافت کلید دسترسی» به لیست قیمت دقیق دسترسی پیدا کنید.\n\n❖ ویژگی های VPN\nنقاط پایانی VPN: TCP/UDP\nکل شبکه: 100 گیگابیت بر ثانیه\nبه روز رسانی: 99.97٪\nاتصال همزمان: نامحدود\nمحدودیت دستگاه: نامحدود"

