# VARIABLE
'''
All text variables in the bot
'''

import random
start_text = 'به Outline VPN خوش آمدید.\n می توانید کلید دسترسی Outline VPN خود را از منوی Get Access Key ایجاد کرده و شروع به استفاده از آن کنید.'

get_menu_text = 'عملیاتی را که می خواهید انجام دهید انتخاب کنید:'

def contact_text():
    ticket_id = random.randint(10000, 99999)
    text = f'اگر به مشکلی برخوردید یا سؤال یا نگرانی دارید، ما همیشه خوشحالیم که به شما کمک کنیم.در هر زمان با ما تماس بگیرید.\n\n کد پشتیبانی شما: `{ticket_id}`'
    return text

referral_program_text = '❖ برنامه ارجاع\nکاربران را دعوت کنید و به دلار آمریکا پاداش بگیرید.\n\nبا دعوت از کاربران می توانید جوایز زیر را کسب کنید:\n• 10% کارمزد تمام سپرده های آنها.\n\nبرای دعوت از کاربران از لینک های زیر استفاده کنید\n`https://t.me/Outline_Man_Bot?start`'

choose_language_text = 'زبان خود را انتخاب کنید'

get_access_key_text = 'انتخاب کشور محل اقامت:'

other_operations_text = "عملیاتی را که می خواهید انجام دهید انتخاب کنید:"

what_outline_text = "❖ Outline VPN چیست؟ \nOutline به هر کسی امکان می‌دهد با اجرای VPN خود با خیال راحت‌تر به اینترنت رایگان و باز دسترسی داشته باشد. اجرای سرور VPN خود از طریق Outline دسترسی به اینترنت را ایمن تر می کند و اتصالی را ایجاد می کند که مسدود کردن آن سخت تر است."

why_outline_text = "❖ چرا Outline VPN؟ \nOutline زمانی کار می کند که سایر VPN ها مسدود شده باشند و در برابر اشکال پیچیده سانسور مانند مسدود کردن مبتنی بر شبکه یا مسدود کردن IP مقاوم باشد. \n Outline انعطاف پذیرتر است زیرا با استفاده از پروتکلی طراحی شده است که تشخیص آن دشوار است و بنابراین مسدود کردن آن سخت تر است. \n به طور خصوصی دسترسی به سرور خود را با گروهی از افراد قابل اعتماد به اشتراک بگذارید. افراد کمتری که به سرور شما متصل هستند به این معنی است که شناسایی آن سخت تر است و راحت تر می توانید خصوصی بمانید."

cancel_text = 'عملیات لغو شده است.'

outline_secure_text = "❖ آیا Outline امن است؟ \nOutline توسط دو شرکت امنیتی مستقل حسابرسی شده است.\n\nگزارش‌های آنها را اینجا بخوانید: Radically Open Security (مارس 2018، دسامبر 2022)، Cure53 (دسامبر 2018)."

why_use_text = "❖ چرا از VPN استفاده کنیم؟\nVPN ها برای خصوصی نگه داشتن ارتباطات شما مفید هستند و به شما امکان می دهند دسترسی به اینترنت باز را حفظ کنید. اما با اکثر ارائه دهندگان VPN، همیشه نمی دانید چه کسی VPN را کنترل می کند و چه کسی به داده های شما دسترسی دارد.\n\nایجاد سرور VPN خود تا کنون یک فرآیند پیچیده بود."

how_to_outline_text = "❖ چگونه از Outline VPN استفاده کنیم؟\n1) کلید دسترسی خود را از طریق ربات تلگرام Outline VPN (https://t.me/getoutlinevpn_bot) یا وب سایت (https://www.getoutlinevpn.com/) دریافت کنید.\n\n2) برنامه Outline VPN مناسب برای سیستم عامل خود را از منوی Application Center (https://www.getoutlinevpn.com/download) نصب کنید.\n\n3) برنامه Outline VPN را اجرا کنید.\n\n4) کلید دسترسی ایجاد شده را با کلیک بر روی علامت + در گوشه سمت راست بالا وارد کنید و روی دکمه «افزودن سرور» کلیک کنید.\n\n5) می توانید آن را با دکمه \"اتصال\" در کنار نام نمایه خود فعال کنید."

app_center_text = "پلتفرمی را که می خواهید Outline VPN را در آن راه اندازی کنید انتخاب کنید:"

price_list_text = "❖ لیست قیمت\nOutline به هر کسی امکان می‌دهد با اجرای VPN خود با خیال راحت‌تر به اینترنت رایگان و باز دسترسی داشته باشد. اجرای سرور VPN خود از طریق Outline دسترسی به اینترنت را ایمن تر می کند و اتصالی را ایجاد می کند که مسدود کردن آن سخت تر است. همین امروز کلید دسترسی Outline VPN خود را دریافت کنید.\n\nهزینه های VPN را به ازای هر ترافیک مشخص کنید. شما می توانید بسته ای را انتخاب کنید که متناسب با نیاز شما باشد. می توانید از منوی «دریافت کلید دسترسی» به لیست قیمت دقیق دسترسی پیدا کنید.\n\n❖ ویژگی های VPN\nنقاط پایانی VPN: TCP/UDP\nکل شبکه: 100 گیگابیت بر ثانیه\nبه روز رسانی: 99.97٪\nاتصال همزمان: نامحدود\nمحدودیت دستگاه: نامحدود"

quest_text = """❖ وظایف را کامل کنید و کسب درآمد کنید
برای برنده شدن تا 20 دلار پاداش، وظایف را کامل کنید

وظایف
• به کانال تلگرام Outline VPN (https://t.me/getoutlinevpn_channel) بپیوندید.
پاداش: 1.00 دلار
• کانال تلگرام Outline VPN (https://t.me/boost/getoutlinevpn_channel) را 4 بار تقویت کنید.
پاداش: 4.00 دلار
• بررسی و رأی موافق Outline VPN در برنامه Ton (https://ton.app/vpn/outline-vpn?id=1441).
پاداش: 1.00 دلار
• یک پست یا داستان درباره Outline VPN در حساب رسانه اجتماعی خود به اشتراک بگذارید.
پاداش: 1.00 دلار
• نظرات خود را در مورد Outline VPN در کانال YouTube یا Twitch خود به اشتراک بگذارید.
پاداش: 10.00 دلار
• نظرات خود را در مورد Outline VPN در وب سایت خود به اشتراک بگذارید.
پاداش: 3.00 دلار

الزامات مشارکت
• اکانت شما باید حداقل 1000 فالوور داشته باشد.
• حساب شما باید بیش از 180 روز پیش ایجاد شده باشد.
• پیوند ربات Outline VPN باید به پست شما اضافه شود.
• پست شما باید حداقل 24 ساعت در حساب شما باقی بماند.

قوانین مشارکت
• هر حساب کاربری فقط ماهی یک بار می تواند از هر پاداش ذکر شده بهره مند شود.
• در صورت حذف بوست های کانال تلگرام قبل از تاریخ پایان، ممکن است حساب شما کسر شود.
• همه ادعاهای پاداش. در اولین روز هفته بعد به حساب شما واریز می شود."""

play_text = """❖ بازی و کسب درآمد
برای انجام بازی ها جوایزی کسب کنید. سرگرم کننده ترین راه برای کسب امتیاز برای Outline VPN Rewards، بازی بولینگ است. ربات تلگرام Strike و 1.00 دلار Outline VPN به حساب شما اضافه می شود.

چگونه بازی کنیم؟
ایموجی بولینگ (🎳) را به ربات Outline VPN ارسال کنید."""

about_text = """❖ ما کی هستیم؟
Outline یک پروژه منبع باز است که راه امن تری را برای افراد و سازمان ها برای دسترسی به اینترنت باز فراهم می کند.

تماس با ما
اگر به مشکلی برخوردید یا سؤال یا نگرانی دارید، ما همیشه خوشحالیم که به شما کمک کنیم. در هر زمان با ما تماس بگیرید.

ایمیل: support@getoutlinevpn.com
وب سایت: getoutlinevpn.com
تلگرام: @getoutlinevpn_support"""

system_status_text = """❖ وضعیت سیستم
سیستم Outline VPN را در زمان واقعی نظارت کنید.

همه سیستم ها عملیاتی 🎉"""

trouble_text="""هنگام استفاده از Outline، ممکن است انواع پیام های خطا را مشاهده کنید. این منو به معنای هر یک از این پیام های خطا توضیح می دهد."""

web_page_text = """❖ صفحات وب به کندی بارگیری می شوند؟
راه حل شماره 1
بین چندین آداپتور شبکه در ویندوز به درستی اولویت بندی کنید.

1) اسکریپت تعمیر (https://www.getoutlinevpn.com/files/outline-page-slowly-fix.bat) را دانلود کنید.
2) روی فایل «outline-page-slowly-fix.bat» در فهرست دانلود کلیک راست کرده و «Run as Administrator» را انتخاب کنید.
3) پس از اتمام نصب، برنامه Outline را باز کنید.

راه حل شماره 2
این پروتکل به شما امکان می دهد اتصال خود را به DNS رمزگذاری کنید تا از پرس و جوهای DNS خود در برابر نفوذ و دستکاری حریم خصوصی محافظت کنید.

1) منوی سه نقطه را در مرورگر خود > تنظیمات انتخاب کنید.
2) Privacy and security > Security را انتخاب کنید.
3) به پایین بروید و Use safe DNS را فعال کنید.
4) گزینه With را انتخاب کنید و از منوی کشویی Add custom DNS service provider را انتخاب کنید.
5) URL درخواست DNS سفارشی را به عنوان https://privacy.plumedns.com/dns-query وارد کنید."""

server_config_text = """❖ چگونه خطای IllegalServerConfiguration را حل کنیم؟
این مشکل زمانی رخ می دهد که اتصال Outline VPN از برنامه Outline فعال نشده باشد.

1) روی تنظیمات در صفحه اصلی ضربه بزنید
2) روی VPN در تنظیمات ضربه بزنید.
3) وضعیت VPN را روی Not Connected تنظیم کنید.
4) برنامه Outline را باز کنید.
5) می توانید آن را با دکمه "اتصال" در کنار نام نمایه خود فعال کنید."""

ipc_start_text = """❖ چگونه خطای outline-ipc-start-proxying را حل کنیم؟
در برخی موارد، این مشکل زمانی رخ می دهد که زبان ویندوز الفبای لاتین نباشد.

1) اسکریپت تعمیر (https://www.getoutlinevpn.com/files/tap-windows-9.9.2.exe) را دانلود کنید.
2) فایل 'tap-windows-9.9.2.exe' را که دانلود کرده اید نصب کنید.
3) به Control Panel > Network and Share Center > Change Network Adaptor بروید.
4) «TAP-Windows Adapter V9» را پیدا کنید
5) نام آن را به outline-tap0 تغییر دهید.
6) پس از تغییر نام، برنامه Outline را باز کنید.
7) می توانید آن را با دکمه "اتصال" در کنار نام نمایه خود فعال کنید."""

unexpected_error_text = """❖ چگونه یک خطای غیرمنتظره رخ داده را حل کنیم؟
این به دلیل عدم وجود MSVCP140.dll و VCRUNTIME140.dll در ویندوز شما است.

1) اسکریپت تعمیر (https://aka.ms/vs/17/release/vc_redist.x86.exe) را دانلود کنید.
2) فایل 'VC_redist.x86.exe' را که دانلود کرده اید نصب کنید.
3) برنامه Outline را باز کنید.
4) می توانید آن را با دکمه "اتصال" در کنار نام نمایه خود فعال کنید."""

vpn_permission_text = """❖ چگونه خطای VpnPermissionNotGranted را حل کنیم؟
این مشکل زمانی رخ می دهد که همیشه در VPN روشن باشد.

1) برنامه تنظیمات دستگاه خود را باز کنید.
2) روی Network & internet ضربه بزنید.
3) روی VPN ضربه بزنید.
اگر نتوانستید آن را پیدا کنید، "VPN" را جستجو کنید.
4) در کنار همه برنامه‌های VPN، روی تنظیمات ⚙️ ضربه بزنید.
5) اگر روشن است، VPN همیشه روشن را خاموش کنید.
6) در صورت نیاز، روی ذخیره ضربه بزنید."""

connected_text = """❖ چگونه اتصال وصل اما دسترسی به اینترنت را حل کنیم؟
این به دلیل پیکربندی نادرست outline-tap0 در ویندوز شما ایجاد می شود.

1) کنترل پنل را از طریق منوی استارت یا جستجوی ویندوز باز کنید.
۲) به دسته Network and Internet و سپس Network and Sharing Center بروید.
3) در پانل سمت چپ، روی «تغییر تنظیمات آداپتور» کلیک کنید.
4) روی "outline-tap0" خود کلیک راست کرده و Properties را انتخاب کنید.
5) "پروتکل اینترنت نسخه 4 (TCP/IPv4)" را در لیست پیدا کنید، آن را انتخاب کنید و سپس دوباره روی Properties کلیک کنید.
6) "دریافت آدرس IP به طور خودکار" و "دریافت آدرس سرور DNS به طور خودکار" را انتخاب کنید.
7) روی دکمه OK کلیک کنید."""

err_routing_text = """❖ چگونه اتصال وصل اما دسترسی به اینترنت را حل کنیم؟
این به دلیل پیکربندی نادرست outline-tap0 در ویندوز شما ایجاد می شود.

1) کنترل پنل را از طریق منوی استارت یا جستجوی ویندوز باز کنید.
۲) به دسته Network and Internet و سپس Network and Sharing Center بروید.
3) در پانل سمت چپ، روی «تغییر تنظیمات آداپتور» کلیک کنید.
4) روی "outline-tap0" خود کلیک راست کرده و Properties را انتخاب کنید.
5) "پروتکل اینترنت نسخه 4 (TCP/IPv4)" را در لیست پیدا کنید، آن را انتخاب کنید و سپس دوباره روی Properties کلیک کنید.
6) "دریافت آدرس IP به طور خودکار" و "دریافت آدرس سرور DNS به طور خودکار" را انتخاب کنید.
7) روی دکمه OK کلیک کنید."""

iphone8_older_text = """❖ چگونه از Outline VPN در آیفون 8 و بالاتر استفاده کنیم؟
این مشکل زمانی رخ می دهد که کلید دسترسی به طور خودکار شناسایی نشود.

1) کلید دسترسی خود را از ربات تلگرام Outline VPN (https://t.me/getoutlinevpn_bot) کپی کنید.
2) برنامه Outline VPN را اجرا کنید.
3) لوگوی Outline را لمس کنید و پنجره افزودن سرور را ببندید.
4) روی علامت + در گوشه سمت راست بالا کلیک کنید.
5) Outline VPN به طور خودکار کلید دسترسی شما را شناسایی می کند.
6) روی دکمه «افزودن سرور» کلیک کنید.
7) می توانید آن را با دکمه "اتصال" در کنار نام نمایه خود فعال کنید."""
